export const colors = {
  black: '#000000', // #000000
  white: '#ffffff', // #ffffff
  grey: {
    50: '#F8F9FA', // R248 G249 B250
    100: '#F1F3F5', // R241 G243 B245
    200: '#E9ECEF', // R233 G236 B239
    300: '#C9CDD1', // R201 G205 B209
    400: '#B6BBC0', // R182 G187 B192
    500: '#9AA1A8', // R154 G161 B168
    600: '#70777E', // R112 G119 B126
    700: '#53595E', // R83  G89  B94
    800: '#303438', // R48  G52  B56
    900: '#212528', // R33  G37  B40
  },
  primary: {
    100: '#EEF0FF', // R238 G240 B255
    200: '#DDE1FF', // R221 G225 B255
    300: '#C4CCFF', // R196 G204 B255
    400: '#8FA2FF', // R143 G162 B255
    500: '#4F78FF', // R79  G120 B255
    600: '#003594', // R0   G52  B148
    700: '#00125C', // R0   G18  B92
    800: '#010F32', // R1   G15  B50
  },
  secondary: {
    100: '#DBFEE6', // R216 G254 B230
    200: '#A5F4C2', // R165 G244 B194
    300: '#7AEAA3', // R122 G234 B163
    400: '#43DF7B', // R67  G223 B123
    500: '#00D149', // R0   G209 B73
    600: '#02B242', // R2   G178 B66
    700: '#026F2A', // R2   G111 B42
    800: '#01471C', // R1   G71  B28
  },
  semantic: {
    100: '#FFCCD6', // R255 G206 B214
    200: '#FFA8B3', // R255 G168 B179
    300: '#FF7F8D', // R255 G127 B141
    400: '#FF4C5E', // R255 G76  B94
    500: '#FF293E', // R255 G41  B62
    600: '#CB1D2F', // R200 G29  B47
    700: '#911120', // R145 G17  B32
    800: '#5E0512', // R94  G5   B18
  },

  // 디자인 시스템에 정의되지 않은 라이트/다크 테마 컬러
  undefined_palette: {
    100: '#ffffff', // white
    200: '#ffffff', // white
    300: '#000000', // black
    400: '#000000', // black
    500: '#DDE1FF', // primary[200]
    600: '#424951', // darkModeColors.grey[100]
    700: '#ffffff', // white
    800: '#F8F9FA', // grey[50]
    900: '#F8F9FA', // grey[50]
    1000: '#ffffff', // white
  },
} as const;
